app/Helpers/functions.php

select * from `admins` where `id` = 1 limit 1
---
    function admin()
    {
        return Admin::with('roles')->where('id', auth()->guard('admin')->id())->first();

select * from `users` where `id` = 1 limit 1
---
    function user()
    {
        $user = User::with('roles')->where('id', auth()->guard('web')->id())->first();