app/Repositories/ProductRepository.php

select * from `categories` where `categories`.`id` in (1)
select * from `products` where `created_by` = 1 limit 50 offset 0
select count(*) as aggregate from `products` where `created_by` = 1
---
    public function index($seller_id){
        $data['products'] = Product::with('category')->where('created_by', $seller_id)->paginate(50);

insert into `products` (`name`, `category_id`, `price`, `discount`, `status`, `created_by`, `updated_by`, `status_date`, `updated_at`, `created_at`) values ('test nominee', '1', '590', '11', 'In Stock', 1, 1, '2023-12-21 07:29:45', '2023-12-21 07:29:45', '2023-12-21 07:29:45')
---
    public function store($request){
        $product = Product::create($request);

select * from `categories`
select * from `products` where `products`.`id` = 2 limit 1
---
    public function edit(int $id){
        $data['categories'] = Category::all();
        $data['statuses'] = Enums::PRODUCT_STATUS;
        $data['title'] = 'PRODUCTS EDIT';
        $data['product'] = Product::find($id);